# Общие вспомогательные функции.
import re
import os

# ----------------------------------------------------------------------------------------------------------------------
import ujson


# ----------------------------------------------------------------------------------------------------------------------

def natural_order(val):  # естественная сортировка
    return [int(text) if text.isdigit() else text.lower() for text in re.split('(\d+)', val)]


# ----------------------------------------------------------------------------------------------------------------------
def load(file_path):
    """Загрузка данных типа json из файла (file_path)"""
    try:
        with open(file_path, 'r') as f:
            data = ujson.load(f)
            return data
    except ujson.JSONDecodeError:
        print(f"Файл {file_path} пустой, либо содержит некорректные данные.")
        return None


# ----------------------------------------------------------------------------------------------------------------------

def save(json_path, data, mode='w'):
    """Сохранение данных (data) в файл json (json_path)"""
    with open(json_path, mode) as f:
        ujson.dump(data, f)


# ----------------------------------------------------------------------------------------------------------------------

def check_file(args):
    """Двойная проверка на наличие файлов"""
    if args is None:  # проверка на существование...
        return False
    if not os.path.exists(args[0]):  # ...и открытие
        return False
    return True
